## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # azurerm_key_vault.vault has been deleted
  - resource "azurerm_key_vault" "vault" {
      - id                              = "/subscriptions/0f1c072e-c866-4a84-929e-2ac38ef99c99/resourceGroups/rg-dropboxsign-uat/providers/Microsoft.KeyVault/vaults/kv-dropboxsign-uat" -> null
        name                            = "kv-dropboxsign-uat"
      - vault_uri                       = "https://kv-dropboxsign-uat.vault.azure.net/" -> null
        # (12 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # azurerm_resource_group.resource_group has been deleted
  - resource "azurerm_resource_group" "resource_group" {
      - id         = "/subscriptions/0f1c072e-c866-4a84-929e-2ac38ef99c99/resourceGroups/rg-dropboxsign-uat" -> null
      - location   = "eastus" -> null
      - name       = "rg-dropboxsign-uat" -> null
        tags       = {}
        # (1 unchanged attribute hidden)
    }

  # azurerm_service_plan.app_service_plan_function has been deleted
  - resource "azurerm_service_plan" "app_service_plan_function" {
      - id                           = "/subscriptions/0f1c072e-c866-4a84-929e-2ac38ef99c99/resourceGroups/rg-dropboxsign-uat/providers/Microsoft.Web/serverFarms/asp-dropboxsign-uat-func" -> null
        name                         = "asp-dropboxsign-uat-func"
        tags                         = {}
        # (11 unchanged attributes hidden)
    }

  # azurerm_storage_account.storage_account has been deleted
  - resource "azurerm_storage_account" "storage_account" {
        id                                = "/subscriptions/0f1c072e-c866-4a84-929e-2ac38ef99c99/resourceGroups/rg-dropboxsign-uat/providers/Microsoft.Storage/storageAccounts/stdropboxsignuatb3e1e7b0"
      - name                              = "stdropboxsignuatb3e1e7b0" -> null
      - primary_access_key                = (sensitive value) -> null
      - primary_connection_string         = (sensitive value) -> null
        tags                              = {}
        # (61 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # azurerm_storage_container.storage_container has been deleted
  - resource "azurerm_storage_container" "storage_container" {
        id                                = "https://stdropboxsignuatb3e1e7b0.blob.core.windows.net/scdropboxsign-uat"
      - name                              = "scdropboxsign-uat" -> null
        # (8 unchanged attributes hidden)
    }

  # azurerm_user_assigned_identity.key_vault_access has been deleted
  - resource "azurerm_user_assigned_identity" "key_vault_access" {
      - client_id           = "fccf8cab-9efb-4566-b51b-fe1c9fc3c4ab" -> null
      - id                  = "/subscriptions/0f1c072e-c866-4a84-929e-2ac38ef99c99/resourceGroups/rg-dropboxsign-uat/providers/Microsoft.ManagedIdentity/userAssignedIdentities/uai-dropboxsign-uat" -> null
        name                = "uai-dropboxsign-uat"
      - principal_id        = "cbe6439b-d927-433c-a13f-c7a7450e198c" -> null
        tags                = {}
        # (3 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.azurerm_storage_account_blob_container_sas.storage_account_blob_container_sas will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_storage_account_blob_container_sas" "storage_account_blob_container_sas" {
      + connection_string = (sensitive value)
      + container_name    = "scdbsign-uat"
      + expiry            = "2026-01-01T00:00:00Z"
      + id                = (known after apply)
      + sas               = (sensitive value)
      + start             = "2024-01-01T00:00:00Z"

      + permissions {
          + add    = false
          + create = false
          + delete = false
          + list   = false
          + read   = true
          + write  = false
        }
    }

  # azurerm_application_insights.application_insights will be created
  + resource "azurerm_application_insights" "application_insights" {
      + app_id                                = (known after apply)
      + application_type                      = "Node.JS"
      + connection_string                     = (sensitive value)
      + daily_data_cap_in_gb                  = (known after apply)
      + daily_data_cap_notifications_disabled = (known after apply)
      + disable_ip_masking                    = false
      + force_customer_storage_for_profiler   = false
      + id                                    = (known after apply)
      + instrumentation_key                   = (sensitive value)
      + internet_ingestion_enabled            = true
      + internet_query_enabled                = true
      + local_authentication_disabled         = false
      + location                              = "eastus"
      + name                                  = "ai-dbsign-uat"
      + resource_group_name                   = "rg-dbsign-uat"
      + retention_in_days                     = 90
      + sampling_percentage                   = 100
    }

  # azurerm_key_vault.vault will be created
  + resource "azurerm_key_vault" "vault" {
      + access_policy                 = (known after apply)
      + enable_rbac_authorization     = true
      + enabled_for_disk_encryption   = true
      + id                            = (known after apply)
      + location                      = "eastus"
      + name                          = "kv-dbsign-uat"
      + public_network_access_enabled = true
      + purge_protection_enabled      = false
      + resource_group_name           = "rg-dbsign-uat"
      + sku_name                      = "standard"
      + soft_delete_retention_days    = 90
      + tenant_id                     = "79286924-9f70-4485-9c60-dd0c5fa7516e"
      + vault_uri                     = (known after apply)

      + contact (known after apply)

      + network_acls (known after apply)
    }

  # azurerm_key_vault_secret.access_token will be created
  + resource "azurerm_key_vault_secret" "access_token" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "dropBoxSignAccessToken"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.client_id will be created
  + resource "azurerm_key_vault_secret" "client_id" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "dropBoxSignClientID"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.client_secret will be created
  + resource "azurerm_key_vault_secret" "client_secret" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "dropBoxSignClientSecret"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.refresh_token will be created
  + resource "azurerm_key_vault_secret" "refresh_token" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "dropBoxSignRefreshToken"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_linux_function_app.function_app will be created
  + resource "azurerm_linux_function_app" "function_app" {
      + app_settings                                   = (known after apply)
      + builtin_logging_enabled                        = true
      + client_certificate_enabled                     = false
      + client_certificate_mode                        = "Optional"
      + content_share_force_disabled                   = false
      + custom_domain_verification_id                  = (sensitive value)
      + daily_memory_time_quota                        = 0
      + default_hostname                               = (known after apply)
      + enabled                                        = true
      + ftp_publish_basic_authentication_enabled       = true
      + functions_extension_version                    = "~4"
      + hosting_environment_id                         = (known after apply)
      + https_only                                     = false
      + id                                             = (known after apply)
      + key_vault_reference_identity_id                = (known after apply)
      + kind                                           = (known after apply)
      + location                                       = "eastus"
      + name                                           = "func-dbsign-uat"
      + outbound_ip_address_list                       = (known after apply)
      + outbound_ip_addresses                          = (known after apply)
      + possible_outbound_ip_address_list              = (known after apply)
      + possible_outbound_ip_addresses                 = (known after apply)
      + public_network_access_enabled                  = true
      + resource_group_name                            = "rg-dbsign-uat"
      + service_plan_id                                = (known after apply)
      + site_credential                                = (sensitive value)
      + storage_account_access_key                     = (sensitive value)
      + storage_account_name                           = "stdbsignuatb3e1e7b0"
      + storage_uses_managed_identity                  = false
      + webdeploy_publish_basic_authentication_enabled = true
      + zip_deploy_file                                = (known after apply)

      + identity {
          + identity_ids = (known after apply)
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "UserAssigned"
        }

      + site_config {
          + always_on                               = (known after apply)
          + app_scale_limit                         = (known after apply)
          + container_registry_use_managed_identity = false
          + default_documents                       = (known after apply)
          + detailed_error_logging_enabled          = (known after apply)
          + elastic_instance_minimum                = (known after apply)
          + ftps_state                              = "Disabled"
          + health_check_eviction_time_in_min       = (known after apply)
          + http2_enabled                           = false
          + ip_restriction_default_action           = "Allow"
          + linux_fx_version                        = (known after apply)
          + load_balancing_mode                     = "LeastRequests"
          + managed_pipeline_mode                   = "Integrated"
          + minimum_tls_version                     = "1.2"
          + pre_warmed_instance_count               = (known after apply)
          + remote_debugging_enabled                = false
          + remote_debugging_version                = (known after apply)
          + scm_ip_restriction_default_action       = "Allow"
          + scm_minimum_tls_version                 = "1.2"
          + scm_type                                = (known after apply)
          + scm_use_main_ip_restriction             = false
          + use_32_bit_worker                       = false
          + vnet_route_all_enabled                  = false
          + websockets_enabled                      = false
          + worker_count                            = (known after apply)

          + application_stack {
              + node_version                = "20"
              + use_dotnet_isolated_runtime = false
            }
        }
    }

  # azurerm_logic_app_workflow.logic_app will be created
  + resource "azurerm_logic_app_workflow" "logic_app" {
      + access_endpoint                 = (known after apply)
      + connector_endpoint_ip_addresses = (known after apply)
      + connector_outbound_ip_addresses = (known after apply)
      + enabled                         = true
      + id                              = (known after apply)
      + location                        = "eastus"
      + name                            = "lapp-dbsign-uat"
      + resource_group_name             = "rg-dbsign-uat"
      + workflow_endpoint_ip_addresses  = (known after apply)
      + workflow_outbound_ip_addresses  = (known after apply)
      + workflow_schema                 = "https://schema.management.azure.com/providers/Microsoft.Logic/schemas/2016-06-01/workflowdefinition.json#"
      + workflow_version                = "1.0.0.0"

      + identity {
          + identity_ids = (known after apply)
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "UserAssigned"
        }
    }

  # azurerm_resource_group.resource_group will be created
  + resource "azurerm_resource_group" "resource_group" {
      + id       = (known after apply)
      + location = "eastus"
      + name     = "rg-dbsign-uat"
    }

  # azurerm_role_assignment.current will be created
  + resource "azurerm_role_assignment" "current" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "c8d0eb9d-8fee-4bd0-9f1b-0c15ff4e76c8"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Secrets Officer"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.key_vault_access_role will be created
  + resource "azurerm_role_assignment" "key_vault_access_role" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Secrets Officer"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_service_plan.app_service_plan_function will be created
  + resource "azurerm_service_plan" "app_service_plan_function" {
      + id                           = (known after apply)
      + kind                         = (known after apply)
      + location                     = "eastus"
      + maximum_elastic_worker_count = (known after apply)
      + name                         = "asp-dbsign-uat-func"
      + os_type                      = "Linux"
      + per_site_scaling_enabled     = false
      + reserved                     = (known after apply)
      + resource_group_name          = "rg-dbsign-uat"
      + sku_name                     = "Y1"
      + worker_count                 = (known after apply)
    }

  # azurerm_storage_account.storage_account will be created
  + resource "azurerm_storage_account" "storage_account" {
      + access_tier                        = (known after apply)
      + account_kind                       = "StorageV2"
      + account_replication_type           = "LRS"
      + account_tier                       = "Standard"
      + allow_nested_items_to_be_public    = true
      + cross_tenant_replication_enabled   = true
      + default_to_oauth_authentication    = false
      + dns_endpoint_type                  = "Standard"
      + enable_https_traffic_only          = true
      + id                                 = (known after apply)
      + infrastructure_encryption_enabled  = false
      + is_hns_enabled                     = false
      + large_file_share_enabled           = (known after apply)
      + local_user_enabled                 = true
      + location                           = "eastus"
      + min_tls_version                    = "TLS1_2"
      + name                               = "stdbsignuatb3e1e7b0"
      + nfsv3_enabled                      = false
      + primary_access_key                 = (sensitive value)
      + primary_blob_connection_string     = (sensitive value)
      + primary_blob_endpoint              = (known after apply)
      + primary_blob_host                  = (known after apply)
      + primary_blob_internet_endpoint     = (known after apply)
      + primary_blob_internet_host         = (known after apply)
      + primary_blob_microsoft_endpoint    = (known after apply)
      + primary_blob_microsoft_host        = (known after apply)
      + primary_connection_string          = (sensitive value)
      + primary_dfs_endpoint               = (known after apply)
      + primary_dfs_host                   = (known after apply)
      + primary_dfs_internet_endpoint      = (known after apply)
      + primary_dfs_internet_host          = (known after apply)
      + primary_dfs_microsoft_endpoint     = (known after apply)
      + primary_dfs_microsoft_host         = (known after apply)
      + primary_file_endpoint              = (known after apply)
      + primary_file_host                  = (known after apply)
      + primary_file_internet_endpoint     = (known after apply)
      + primary_file_internet_host         = (known after apply)
      + primary_file_microsoft_endpoint    = (known after apply)
      + primary_file_microsoft_host        = (known after apply)
      + primary_location                   = (known after apply)
      + primary_queue_endpoint             = (known after apply)
      + primary_queue_host                 = (known after apply)
      + primary_queue_microsoft_endpoint   = (known after apply)
      + primary_queue_microsoft_host       = (known after apply)
      + primary_table_endpoint             = (known after apply)
      + primary_table_host                 = (known after apply)
      + primary_table_microsoft_endpoint   = (known after apply)
      + primary_table_microsoft_host       = (known after apply)
      + primary_web_endpoint               = (known after apply)
      + primary_web_host                   = (known after apply)
      + primary_web_internet_endpoint      = (known after apply)
      + primary_web_internet_host          = (known after apply)
      + primary_web_microsoft_endpoint     = (known after apply)
      + primary_web_microsoft_host         = (known after apply)
      + public_network_access_enabled      = true
      + queue_encryption_key_type          = "Service"
      + resource_group_name                = "rg-dbsign-uat"
      + secondary_access_key               = (sensitive value)
      + secondary_blob_connection_string   = (sensitive value)
      + secondary_blob_endpoint            = (known after apply)
      + secondary_blob_host                = (known after apply)
      + secondary_blob_internet_endpoint   = (known after apply)
      + secondary_blob_internet_host       = (known after apply)
      + secondary_blob_microsoft_endpoint  = (known after apply)
      + secondary_blob_microsoft_host      = (known after apply)
      + secondary_connection_string        = (sensitive value)
      + secondary_dfs_endpoint             = (known after apply)
      + secondary_dfs_host                 = (known after apply)
      + secondary_dfs_internet_endpoint    = (known after apply)
      + secondary_dfs_internet_host        = (known after apply)
      + secondary_dfs_microsoft_endpoint   = (known after apply)
      + secondary_dfs_microsoft_host       = (known after apply)
      + secondary_file_endpoint            = (known after apply)
      + secondary_file_host                = (known after apply)
      + secondary_file_internet_endpoint   = (known after apply)
      + secondary_file_internet_host       = (known after apply)
      + secondary_file_microsoft_endpoint  = (known after apply)
      + secondary_file_microsoft_host      = (known after apply)
      + secondary_location                 = (known after apply)
      + secondary_queue_endpoint           = (known after apply)
      + secondary_queue_host               = (known after apply)
      + secondary_queue_microsoft_endpoint = (known after apply)
      + secondary_queue_microsoft_host     = (known after apply)
      + secondary_table_endpoint           = (known after apply)
      + secondary_table_host               = (known after apply)
      + secondary_table_microsoft_endpoint = (known after apply)
      + secondary_table_microsoft_host     = (known after apply)
      + secondary_web_endpoint             = (known after apply)
      + secondary_web_host                 = (known after apply)
      + secondary_web_internet_endpoint    = (known after apply)
      + secondary_web_internet_host        = (known after apply)
      + secondary_web_microsoft_endpoint   = (known after apply)
      + secondary_web_microsoft_host       = (known after apply)
      + sftp_enabled                       = false
      + shared_access_key_enabled          = true
      + table_encryption_key_type          = "Service"

      + blob_properties (known after apply)

      + network_rules (known after apply)

      + queue_properties (known after apply)

      + routing (known after apply)

      + share_properties (known after apply)
    }

  # azurerm_storage_blob.storage_blob will be created
  + resource "azurerm_storage_blob" "storage_blob" {
      + access_tier            = (known after apply)
      + content_type           = "application/octet-stream"
      + id                     = (known after apply)
      + metadata               = (known after apply)
      + name                   = "784619dc691f1cdb6f56a139356d881ece86b887fcbc20c5e45ce5a5fcd13804.zip"
      + parallelism            = 8
      + size                   = 0
      + source                 = "./../../../build/function-app.zip"
      + storage_account_name   = "stdbsignuatb3e1e7b0"
      + storage_container_name = "scdbsign-uat"
      + type                   = "Block"
      + url                    = (known after apply)
    }

  # azurerm_storage_container.storage_container will be created
  + resource "azurerm_storage_container" "storage_container" {
      + container_access_type             = "private"
      + default_encryption_scope          = (known after apply)
      + encryption_scope_override_enabled = true
      + has_immutability_policy           = (known after apply)
      + has_legal_hold                    = (known after apply)
      + id                                = (known after apply)
      + metadata                          = (known after apply)
      + name                              = "scdbsign-uat"
      + resource_manager_id               = (known after apply)
      + storage_account_name              = "stdbsignuatb3e1e7b0"
    }

  # azurerm_user_assigned_identity.key_vault_access will be created
  + resource "azurerm_user_assigned_identity" "key_vault_access" {
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + location            = "eastus"
      + name                = "uai-dbsign-uat"
      + principal_id        = (known after apply)
      + resource_group_name = "rg-dbsign-uat"
      + tenant_id           = (known after apply)
    }

Plan: 16 to add, 0 to change, 0 to destroy.
```
</details>